# Abbreviation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalLoadClassification..::..Abbreviation Property
ElectricalLoadClassification Class See Also
---
The abbreviation of the load classification name
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public string Abbreviation { get; set; }
```

Visual Basic
---
```text
Public Property Abbreviation As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Abbreviation {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: abbreviation is an empty string or contains only whitespace. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace